<template>
    <page-template v-bind=info>

        <template v-slot:Face>
            <div>Палата Представителей и Совет Республики</div>
            <div>Национального Собрания</div>
            <div>Республики Беларусь</div>
        </template>

        <template v-slot:First>
            <p>
                Нижняя палата парламента и Кабинет министров расположены в <b>Доме Правительства</b>, 
                Минск, Белоруссия. В одном из лучших памятников <b>Советского Конструктивизма</b>, положивший начало
                формированию нового центра города.
                Оно было построено в 1934 году по проекту Иосифа Лангбарда. 
                Он стоит за статуей Владимира Ленина и является <u>одним из немногих зданий, 
                переживших Великую Отечественную войну.</u>
            </p>
            <p>
                Верхняя палата расположена в старом здании <b>Национальной библиотеки имени Ленина</b>,
                которое также является прекрасным примером <b>Советского Конструктивизма</b> начала 20 века.
            </p>
        </template>

        <template v-slot:Second>
            <p>
                <b>Палата Представителей</b> Национального Собрания Республики Беларусь                
                это нижняя палата парламента Беларуси, а верхняя палата - Совет Республики.
                Он был создан после того, как в 1996 году в Конституцию Беларуси были внесены поправки,
                заменившие Верховный Совет Беларуси.
                Он состоит из 110 депутатов, избираемых на четырехлетний срок
            </p>
            <p>
                <b>Совет Республики</b> Национального Собрания Республики Беларусь
                является верхней палатой парламента Беларуси.
                Совет состоит из 64 членов, и представительство основано географически,
                при этом большинство избранных членов представляют организации гражданского общества, 
                трудовые коллективы и общественные объединения, находящиеся в их юрисдикции.
            </p>
        </template>

    </page-template>
</template>

<script>
import PageTemplate from '@/components/PageTemplate.vue'

export default{
    name: 'Belarus',
    components:{
        PageTemplate
    },
    data(){
        return{
            info: {
                imgNum: 25,
                country: "Belarus",
                title: "Национальное Собрание Беларуси",
                pageTheme: "green darken-2",
                lang: 'ru',
            }
        }
    }
}
</script>