<template>
    <page-template v-bind=info>

        <template v-slot:Face>
            <div>Бундестаг</div>
            <div>Федеративной Республики Германия</div>
        </template>

        <template v-slot:First>
            <p>
                В настоящее время Парламент Германии - Бундестаг - занимает несколько зданий в "Административном районе".
                Среди этих зданий: 
                <b>Здание Рейхстага, Дом Якоба Кайзера, Дом Пауля Лёбе и Дом Марии-Элизабет Людерс.</b> 
                Последние два здания с Федеральной Канцелярией являются частью так называемой "Федеральной Ленты".
            </p>
            <p>
                Пленарные заседания проводятся в самом здании Рейхстага, и здесь есть постоянная экспозиция
                о Немецком парламенте с красивым общественным пространством под куполом. 
                Офисы депутатов расположены в Доме Якоба Кайзера. 
                В Доме Пауля Лёбе расположены комитеты, офисы и небольшие конференц-залы. 
                В Доме Марии-Элизабет Людерс есть парламентская библиотека.
            </p>
        </template>

        <template v-slot:Second>
            <p>
                <b>Бундестаг (Федеральное Собрание)</b> - Однопалатный Федеральный Парламент. 
                Это единственный федеральный представительный орган, который избирается непосредственно Немецким народом.
            </p>
            <p>
                Это сопоставимо с Палатой Представителей Соединённых Штатов,
                Палатой Общин Соединённого Королевства
                и Государственной Думой Российской Федерации.
                Это один из законодательных органов Германии, и, таким образом, он является историческим преемником
                более раннего Рейхстага.
            </p>
            <p>
                <b>Бундесрат (Федеральный Совет)</b> - обычно считается верхней палатой парламента,
                хотя формально таковой не является. 
                И является отдельным законодательным органом, который де-факто выполняет роль верхней палаты
            </p>
        </template>

    </page-template>
</template>

<script>
import PageTemplate from '@/components/PageTemplate.vue'

export default{
    name: 'Germany',
    components:{
        PageTemplate
    },
    data(){
        return{
            info: {
                imgNum: 25,
                country: "Germany",
                title: "Бундестаг Германии",
                pageTheme: "red darken-3",
                lang: 'ru',
            }
        }
    }
}
</script>