<template>
    <page-template v-bind=info>

        <template v-slot:Face>
            <div>Государственное Собрание</div>
            <div>Венгрии</div>
        </template>

        <template v-slot:First>
            <p> 
                Дворец построен в 1904 году.
                Парламент занимает дворец в архитектурном стиле <b>Неоготического Возрождения</b>.
                Он был спроектирован венгерским архитектором Имре Штайндлем.
                Это было самое большое здание в Венгрии с момента его завершения.
                На архитектурный стиль здания Венгерского парламента повлияла готическая <b>Венская Ратуша</b>,
                элементы <b>Ренессанса</b>, такие как купол, были созданы под влиянием <b>церкви Марии Победительницы</b> 
                в Вене.
                Во времена Венгерской Народной Республики на вершине купола красовалась <u>красная звезда</u>.
            </p>
        </template>

        <template v-slot:Second>
            <p><b>Государственное Собрание</b> - Однопалатный Парламент Венгрии
            состоит из 199 членов, избираемых сроком на 4 года</p>
            <p>Он представляет народ и от его имени вносит законопроекты, поправки 
            и избирает Премьер-министра</p>
        </template>

    </page-template>
</template>

<script>
import PageTemplate from '@/components/PageTemplate.vue'

export default{
    name: 'Hungary',
    components:{
        PageTemplate
    },
    data(){
        return{
            info: {
                imgNum: 21,
                country: "Hungary",
                title: "Государственное Собрание Венгрии",
                footerTheme: "pink darken-4",
                lang: 'ru',
            }
        }
    }
}
</script>