<template>
    <page-template v-bind=info>

        <template v-slot:Face>
            <div>Московская Городская Дума</div>
            <div>Российского города федерального значения Москвы</div>
        </template>

        <template v-slot:First>
            <p>
                В 2015 году Московская Городская Дума переехала в новый комплекс, расположенный в исторических зданиях 
                и на территории бывшей <b>усадьбы князей Гагариных</b> на Страстном бульваре. Ранее,
                с 1833 по 2009 год, в главном здании усадьбы располагалась <b>Ново—Екатерининская больница</b>.
            </p>
            <p>
                <u>Старые здания были восстановлены</u>, а <u>новое здание было построено на охраняемой территории памятника</u>
                для встреч и общественных обсуждений, по проекту Бюро Speech.
            </p>
        </template>

        <template v-slot:Second>
            <p>
                <b>Московская Городская Дума</b> - российский региональный парламент в Москве,
                однопалатная Городская Дума (городской совет, местный парламент) столицы России города Москвы. 
                Поскольку Москва является одним из трех городов федерального значения, законодательство городской думы может быть отменено
                только мэром и федеральным правительством.
                Он состоит из 45 депутатов.
            </p>
            <p>
                В Москве проживает <u>12,5 миллионов человек</u>, что больше, чем в половине европейских стран,
                поэтому Москву в некотором смысле можно считать <u>маленькой страной</u>.
            </p>
        </template>

    </page-template>
</template>

<script>
import PageTemplate from '@/components/PageTemplate.vue'

export default{
    name: 'Moscow',
    components:{
        PageTemplate
    },
    data(){
        return{
            info: {
                imgNum: 17,
                country: "Moscow",
                title: "МосГорДума",
                footerTheme: "red darken-2",
                lang: 'ru',
            }
        }
    }
}
</script>