<template>
    <page-template v-bind=info>

        <template v-slot:Face>
            <div>Государственная Дума и Совет Федерации</div>
            <div>Федерального Собрания</div>
            <div>Российской Федерации</div>
        </template>

        <template v-slot:First>
            <p>
                Государственная Дума расположена в здании <b>Совета Труда и Обороны</b> Москва, Россия. Построенн в 1935 году.
                Ранее в этом здании ненадолго размещалось <b>Совета Труда и Обороны</b> СССР
                Затем в здании разместилась часть <b>Совета Народных Комиссаров - Совета Министров</b> СССР.
                И, наконец, там разместился <b>Госплан (Государственный комитет плановый)</b>
                После распада Советского Союза, с 1994 года,
                в этом здании работает <b>Государственная Дума</b> РФ.
            </p>
            <p>
                Совет Федерации размещается в <b>Здании Госстроя и Госкомархитектуры</b>, построенном в 1936 году.
            </p> 
        </template>

        <template v-slot:Second>
            <p>Федеральное Собрание - двухпалатный Парламент России.</p>
            <p>
                <b>Государственная Дума</b> - это нижняя палата, которая представляет <b>Народ</b> страны. В нем 450 депутатов.
                Дума создает законопроекты и поправки от имени народа. Премьер-министр также подотчетен Думе.
            </p>
            <p>
                <b>Совет Федерации</b> - это верхняя палата, представляющая <b>Субъект Федерации</b>. 
                В нем 170 сенаторов, по 2 от каждого из 85 субъектов.
                Совет Федерации тщательно изучает законопроекты, одобренные Государственной Думой. 
                Он регулярно рассматривает и вносит поправки в законопроекты Думы. 
                В этом качестве Совет Федерации проверяет приемлемость поправок
                Государственной Думы от имени субъектов федерации.
            </p>
        </template>

    </page-template>
</template>

<script>
import PageTemplate from '@/components/PageTemplate.vue'

export default{
    name: 'Russia',
    components:{
        PageTemplate
    },
    data(){
        return{
            info: {
                imgNum: 24,
                country: "Russia",
                title: "Федеральное Собрание России",
                footerTheme: "indigo darken-2",
                lang: 'ru',
            }
        }
    }
}
</script>