<template>
    <page-template v-bind=info>

        <template v-slot:Face>
            <div>Палата Общин и Палата Лордов</div>
            <div>Парламента</div>
            <div>Соединённого Королевства Великобритании и Северной Ирландии</div>
        </template>

        <template v-slot:First>
            <p>
                Парламент занимает Вестминстерский Дворец.
                Он расположен на северном берегу реки Темзы в сити Вестминстер.
                Его название, которое происходит от соседнего Вестминстерского аббатства,
                может относиться к нескольким историческим сооружениям, но чаще всего: Старый дворец,
                средневековый комплекс зданий, в значительной степени разрушенный пожаром в 1834 году, или его замена,
                Новый дворец, который стоит сегодня.
            </p>
        </template>

        <template v-slot:Second>
            <p>В Великобритании двухпалатный парламент.</p>
            <p>
                <b>Палата Общин</b> является выборным органом, состоящим из 650 членов, известных как члены парламента. 
                Депутаты избираются для представления избирательных округов по системе "первый за пост" и
                занимают свои места до роспуска парламента.
                Нижняя палата представляет народ и от его имени вносит законопроекты, поправки 
                и избирает Премьер-министра.
            </p>
            <p>
                <b>Палата Лордов</b> является неизбираемым органом, состоящим из 768 человек. 
                Членство осуществляется по назначению, наследственности или официальной функции.
                Палата лордов тщательно рассматривает законопроекты, одобренные Палатой общин.
                Он регулярно рассматривает и вносит поправки в законопроекты Палаты общин.
                В этом качестве Палата лордов действует как сдерживающий фактор для более могущественной Палаты общин
            </p>
        </template> 

    </page-template>
</template>

<script>
import PageTemplate from '@/components/PageTemplate.vue'

export default{
    name: 'UK',
    components:{
        PageTemplate
    },
    data(){
        return{
            info: {
                imgNum: 17,
                country: "UK",
                title: "Парламент Великобритании",
                pageTheme: "indigo darken-1",
                lang: 'ru',
            }
        }
    }
}
</script>